BuoyantMMAProgram/pitzDaily/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(.*)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0;
        adjointLinearSolverTreatment yes;
    }

    "(p|pReverse)"
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0;
        smoother        DIC;
        adjointLinearSolverTreatment yes;
    }
    
    T
    {
	solver PBiCG;
	preconditioner DILU;
	tolerance 1e-05;
	relTol 0.1;
    }

}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent      yes;
    costFunctionPatches (inlet outlet);
    costFunction "pressureLoss";
    designSpace (Block_2 Block_3);
    solidSpace (Block_2);
    nOptSteps     300;
    maxPiggyLoop 100;
    optTolerance  1e2;
    maxLoop 15;
    maxoutit 8;
    //maxMMA 10;
    //penalty 1;
    //tapeSizeMB 16384;
}

relaxationFactors
{
    equations
    {
        U               0.9; // 0.9 is more stable but 0.95 more convergent
        ".*"            0.9; // 0.9 is more stable but 0.95 more convergent
    }
}


// ************************************************************************* //
